
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнутреннееПотреблениеТоваров" 

	Дано Я открываю основную форму списка документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнутреннееПотреблениеТоваров"

	Дано Я открываю основную форму документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотребление"

	Дано Я открываю основную форму документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПеремещение" 

	Дано Я открываю основную форму списка документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПеремещение"

	Дано Я открываю основную форму документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаСборку" 

	Дано Я открываю основную форму списка документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаСборку"

	Дано Я открываю основную форму документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПереработчику2_5" 

	Дано Я открываю основную форму списка документа "ЗаказПереработчику2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПереработчику2_5"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПереработчику2_5"

	Дано Я открываю основную форму документа "ЗаказПереработчику2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПереработчику2_5"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщику" 

	Дано Я открываю основную форму списка документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщику"

	Дано Я открываю основную форму документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНазначенияТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНазначенияТоваров"

	Дано Я открываю основную форму документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПриобретения" 

	Дано Я открываю основную форму списка документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПриобретения"

	Дано Я открываю основную форму документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеОценочныхОбязательствПоОтпускам" 

	Дано Я открываю основную форму списка документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеОценочныхОбязательствПоОтпускам"

	Дано Я открываю основную форму документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеРезервовПредстоящихРасходов" 

	Дано Я открываю основную форму списка документа "НачислениеСписаниеРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеРезервовПредстоящихРасходов"

	Дано Я открываю основную форму документа "НачислениеСписаниеРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияБух" 

	Дано Я открываю основную форму списка документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияБух"

	Дано Я открываю основную форму документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПереработчика2_5" 

	Дано Я открываю основную форму списка документа "ОтчетПереработчика2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика2_5"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПереработчика2_5"

	Дано Я открываю основную форму документа "ОтчетПереработчика2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика2_5"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаСырьяПереработчику" 

	Дано Я открываю основную форму списка документа "ПередачаСырьяПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаСырьяПереработчику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаСырьяПереработчику"

	Дано Я открываю основную форму документа "ПередачаСырьяПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаСырьяПереработчику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеОС" 

	Дано Я открываю основную форму списка документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеОС"

	Дано Я открываю основную форму документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеТоваров"

	Дано Я открываю основную форму документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланЗакупок" 

	Дано Я открываю основную форму списка документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланЗакупок"

	Дано Я открываю основную форму документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеОтПереработчика" 

	Дано Я открываю основную форму списка документа "ПоступлениеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОтПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеОтПереработчика"

	Дано Я открываю основную форму документа "ПоступлениеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОтПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуОС2_4" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуОС2_4"

	Дано Я открываю основную форму документа "ПринятиеКУчетуОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеТоваровУслуг" 

	Дано Я открываю основную форму списка документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеТоваровУслуг"

	Дано Я открываю основную форму документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеУслугПрочихАктивов"

	Дано Я открываю основную форму документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияТоваровУслуг" 

	Дано Я открываю основную форму списка документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияТоваровУслуг"

	Дано Я открываю основную форму документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборкаТоваров" 

	Дано Я открываю основную форму списка документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборкаТоваров"

	Дано Я открываю основную форму документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетов"

	Дано Я открываю основную форму документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаЗадолженности" 

	Дано Я открываю основную форму списка документа "КорректировкаЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаЗадолженности"

	Дано Я открываю основную форму документа "КорректировкаЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОС2_4" 

	Дано Я открываю основную форму списка документа "СписаниеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОС2_4"

	Дано Я открываю основную форму документа "СписаниеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданный" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданный"

	Дано Я открываю основную форму документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйАванс"

	Дано Я открываю основную форму документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураНалоговыйАгент" 

	Дано Я открываю основную форму списка документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураНалоговыйАгент"

	Дано Я открываю основную форму документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученный" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученный"

	Дано Я открываю основную форму документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйАванс"

	Дано Я открываю основную форму документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияИмпорт" 

	Дано Я открываю основную форму списка документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияИмпорт"

	Дано Я открываю основную форму документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бюро1440_ЗаявкаНаЗакупку" 

	Дано Я открываю основную форму списка документа "Бюро1440_ЗаявкаНаЗакупку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ЗаявкаНаЗакупку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бюро1440_ЗаявкаНаЗакупку"

	Дано Я открываю основную форму документа "Бюро1440_ЗаявкаНаЗакупку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ЗаявкаНаЗакупку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бюро1440_ИзменениеНоменклатурыЗакупки" 

	Дано Я открываю основную форму списка документа "Бюро1440_ИзменениеНоменклатурыЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ИзменениеНоменклатурыЗакупки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бюро1440_ИзменениеНоменклатурыЗакупки"

	Дано Я открываю основную форму документа "Бюро1440_ИзменениеНоменклатурыЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ИзменениеНоменклатурыЗакупки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бюро1440_ИзменениеСостоянияПотребности" 

	Дано Я открываю основную форму списка документа "Бюро1440_ИзменениеСостоянияПотребности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ИзменениеСостоянияПотребности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бюро1440_ИзменениеСостоянияПотребности"

	Дано Я открываю основную форму документа "Бюро1440_ИзменениеСостоянияПотребности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюро1440_ИзменениеСостоянияПотребности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатуры" 

	Дано Я открываю основную форму списка документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатуры"

	Дано Я открываю основную форму документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно



