
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АмортизацияНМА2_4" 

	Дано Я открываю основную форму списка документа "АмортизацияНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияНМА2_4"

	Дано Я открываю основную форму документа "АмортизацияНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияОС2_4" 

	Дано Я открываю основную форму списка документа "АмортизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияОС2_4"

	Дано Я открываю основную форму документа "АмортизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНалогообложенияНДСПартийТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНалогообложенияНДСПартийТоваров"

	Дано Я открываю основную форму документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеПроцентовПоАренде" 

	Дано Я открываю основную форму списка документа "НачислениеПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПроцентовПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеПроцентовПоАренде"

	Дано Я открываю основную форму документа "НачислениеПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПроцентовПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеДоходовПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеДоходовПоНаправлениямДеятельности"

	Дано Я открываю основную форму документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПрочихЗатрат" 

	Дано Я открываю основную форму списка документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПрочихЗатрат"

	Дано Я открываю основную форму документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетКурсовыхРазниц" 

	Дано Я открываю основную форму списка документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетКурсовыхРазниц"

	Дано Я открываю основную форму документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентныеЗаданияЗакрытияМесяца" 

	Дано Я открываю основную форму списка регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентныеЗаданияЗакрытияМесяца"

	Дано Я открываю основную форму регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно


