
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Открытие формы объекта "ДеревоРесурсныхСпецификаций"

	Дано Я открываю основную форму обработки "ДеревоРесурсныхСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДеревоРесурсныхСпецификаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовБезналичныеПлатежи"

	Дано Я открываю основную форму обработки "ЖурналДокументовБезналичныеПлатежи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовБезналичныеПлатежи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовЗакупки"

	Дано Я открываю основную форму обработки "ЖурналДокументовЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНДС"

	Дано Я открываю основную форму обработки "ЖурналДокументовНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНМА2_4"

	Дано Я открываю основную форму обработки "ЖурналДокументовНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНМА2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОС2_4"

	Дано Я открываю основную форму обработки "ЖурналДокументовОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОС2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПереработки"

	Дано Я открываю основную форму обработки "ЖурналДокументовПереработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПереработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПоТМЦВЭксплуатации"

	Дано Я открываю основную форму обработки "ЖурналДокументовПоТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПоТМЦВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПродажи"

	Дано Я открываю основную форму обработки "ЖурналДокументовПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОперацииЗакрытияМесяца"

	Дано Я открываю основную форму обработки "ОперацииЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОперацииЗакрытияМесяца"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтражениеДокументовВРеглУчете"

	Дано Я открываю основную форму обработки "ОтражениеДокументовВРеглУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОтражениеДокументовВРеглУчете"
	И Я закрываю текущее окно


